package codewars;

public class Task3 {
    /*
    Дезоксирибонуклеиновая кислота (ДНК) — это основная молекула для хранения генетической информации
    в биологических системах.
    Она состоит из четырех азотистых оснований: гуанина («G»), цитозина («C»), аденина («A») и тимина («T»).

    Рибонуклеиновая кислота (РНК) — это основная молекула-посредник в клетках.
    РНК незначительно отличается от ДНК по химическому строению и не содержит тимина;
    в РНК тимин заменен другим азотистым основанием — урацилом («U»).

     Напишите функцию, которая преобразует заданную строку ДНК в РНК.
     Например: «GCAT» => «GCAU».

     Входная строка может иметь произвольную длину (в том числе быть пустой).
     Гарантируется корректность входных данных: строка будет состоять только из символов «G», «C», «A» и «T».
     */

    public String dnaToRna(String dna) {
        if (dna.isEmpty()) {
            return "Input string is empty";
        }
        return dna.replace("T", "U");  // Do your magic!
    }

    public static void main(String[] args) {
        Task3 task3 = new Task3();
        System.out.println(task3.dnaToRna(""));
    }
}
